{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "[EOS]": 5,
      "[BOS]": 6,
      "#": 7,
      "(": 8,
      ")": 9,
      "+": 10,
      "-": 11,
      "/": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "=": 21,
      "@": 22,
      "B": 23,
      "C": 24,
      "E": 25,
      "F": 26,
      "H": 27,
      "I": 28,
      "N": 29,
      "O": 30,
      "P": 31,
      "S": 32,
      "[": 33,
      "\\": 34,
      "]": 35,
      "c": 36,
      "l": 37,
      "n": 38,
      "o": 39,
      "r": 40,
      "s": 41,
      "cc": 42,
      "CC": 43,
      "OS": 44,
      "(=": 45,
      "ccc": 46,
      "BOS": 47,
      "EOS": 48,
      "](": 49,
      "@@": 50,
      "Cc": 51,
      "NC": 52,
      "ccccc": 53,
      "nc": 54,
      "CCC": 55,
      ")[": 56,
      "NH": 57,
      "+]": 58,
      "CO": 59,
      "cccc": 60,
      "Nc": 61,
      "Cl": 62,
      "OC": 63,
      "CCN": 64,
      ")(": 65,
      "COc": 66,
      "(-": 67,
      "([": 68,
      "CCCC": 69,
      "CN": 70,
      "-]": 71,
      ")(=": 72,
      "CCO": 73,
      "nH": 74,
      "nn": 75,
      "-])": 76,
      "+](": 77,
      "CCc": 78,
      ")=": 79,
      "sc": 80,
      "CS": 81,
      "ncc": 82,
      "Br": 83,
      "CNC": 84,
      "nnc": 85,
      "NCc": 86,
      "oc": 87,
      "12": 88,
      "+](=": 89,
      "CCCCC": 90,
      "COC": 91,
      "Cn": 92,
      "21": 93,
      "CCCN": 94,
      "cn": 95,
      "+][": 96,
      "Oc": 97,
      "CCOC": 98,
      "CCOCC": 99
    },
    "merges": [
      [
        "c",
        "c"
      ],
      [
        "C",
        "C"
      ],
      [
        "O",
        "S"
      ],
      [
        "(",
        "="
      ],
      [
        "cc",
        "c"
      ],
      [
        "B",
        "OS"
      ],
      [
        "E",
        "OS"
      ],
      [
        "]",
        "("
      ],
      [
        "@",
        "@"
      ],
      [
        "C",
        "c"
      ],
      [
        "N",
        "C"
      ],
      [
        "cc",
        "ccc"
      ],
      [
        "n",
        "c"
      ],
      [
        "CC",
        "C"
      ],
      [
        ")",
        "["
      ],
      [
        "N",
        "H"
      ],
      [
        "+",
        "]"
      ],
      [
        "C",
        "O"
      ],
      [
        "cc",
        "cc"
      ],
      [
        "N",
        "c"
      ],
      [
        "C",
        "l"
      ],
      [
        "O",
        "C"
      ],
      [
        "CC",
        "N"
      ],
      [
        ")",
        "("
      ],
      [
        "CO",
        "c"
      ],
      [
        "(",
        "-"
      ],
      [
        "(",
        "["
      ],
      [
        "CC",
        "CC"
      ],
      [
        "C",
        "N"
      ],
      [
        "-",
        "]"
      ],
      [
        ")",
        "(="
      ],
      [
        "CC",
        "O"
      ],
      [
        "n",
        "H"
      ],
      [
        "n",
        "n"
      ],
      [
        "-]",
        ")"
      ],
      [
        "+",
        "]("
      ],
      [
        "CC",
        "c"
      ],
      [
        ")",
        "="
      ],
      [
        "s",
        "c"
      ],
      [
        "C",
        "S"
      ],
      [
        "n",
        "cc"
      ],
      [
        "B",
        "r"
      ],
      [
        "C",
        "NC"
      ],
      [
        "n",
        "nc"
      ],
      [
        "N",
        "Cc"
      ],
      [
        "o",
        "c"
      ],
      [
        "1",
        "2"
      ],
      [
        "+]",
        "(="
      ],
      [
        "CC",
        "CCC"
      ],
      [
        "CO",
        "C"
      ],
      [
        "C",
        "n"
      ],
      [
        "2",
        "1"
      ],
      [
        "CCC",
        "N"
      ],
      [
        "c",
        "n"
      ],
      [
        "+]",
        "["
      ],
      [
        "O",
        "c"
      ],
      [
        "CC",
        "OC"
      ],
      [
        "CCO",
        "CC"
      ]
    ]
  }
}